{
    "Cairo University": {
        "City:": "Giza",
        "Region:": "Giza",
        "Advertising unit:": "",
        "Phone Number:": "(02) 35729172 , 35676103 : education and Student Affairs(02) 35728360 , 35676138 : graduate studies and research(02) 5728237 : community service and environmental development(02) 5726750 : General Secretary of the University(02) 5735877 : Secretary of the University",
        "Official Website:": "http://cu.edu.eg/ar/Home",
        "Official Facebook Page:": "https://www.facebook.com/cu.edu.eg",
        "Main Address:": "Street Cairo University, el Nahda sq., Cairo.",
        "Year Founded:": "1908",
        "University presidents:": "Ahmad Lutfi El Sayed. (1925 : 1941)Ali Ibrahim (1941 : 1947)Ibrahim shawky (1947 : 1949)D.Mohamed Kamel Morsi (1949 : 1951) and (1954 : 1957)Mohamed Abdel wahab mouro (1951 : 1953)A. smart (1953 : 1954)Dr .El Sayed. Mustafa El Sayed. (1958 : 1961)D.Ahmad badawi (1961 : 1964)D.Mohamed Naguib hashad(1964 : 1966)D.Mohamed Morsi Ahmed(1967 : 1969)Dr.Gaber Gad Abdel Rahman(1969 : 1971)Dr. Hassan Mohamed Ismail(1971 : 1975)Dr . Sophie Hassan Abu Taleb (1975 : 1978)Dr. Ibrahim gamil badran (1978 : 1980)Dr . Hassan hamdy Ibrahim (1980 : 1985)Dr. Helmy Mahmoud Nemr(1985 : 1987)Dr. Mahmoud Najib Hosni (1987 : 1989)Dr. Mamoun Mohamed salama (1989 : 1993)Dr .Mofed shihab (1993 : 1997)Dr. Farouk Ismail (1997 : 1999)Dr. Najib Helaly Gohar(19999 : 2004)Dr. Ali Abdul Rahman Yusuf (2004 : 2008)Dr. Hossam Kamel (2008 : 2013)Dr. Gaber Gad Nassar (2013 : till now).",
        "Central Library:": "The Central Library located inside the campus of the University of Cairo next to the Faculty of Science, consists of 6 halls :1 - the hall of the languages and literature of Europe.2 - hall of Heritage books and Islamic Studies; and basic references in Oriental Studies.3 - Hall of human studies.4 - room of University messages .5 - Hall of references and periodicals.",
        "Conference halls and theaters:": "1 - Grand ball room which attaches the dome of the famous University of Cairo, the main lounge and the first and third track for about four thousand spectators capacity, the main room, the radio room, which is equipped for instant, radio and translation into seven foreign languages at one time.The community Hall main number (1099) spectators, of which 148 seats equipped with a device for interpretation in the first page. The first floor of the number (1269) spectator and the second number (1264) took a seat.2 - The Conference Hall located in the university city students.3 - Theater of the Cairo University located in the city of the university for students.4 - The Conference Center, Faculty of Medicine, Kasr el ainy : the Grand Hall of the theater for up to 900 persons capacity.",
        "playgrounds:": "City of Sports at Cairo University consists of :1 - master football court.2 - football stadium branch.3.  Penta court.4 - sand tiles (basket ball - volley ball- hand ball)5 - Tartan courts.6 - covered room .7 - fighting games room .8 - Athletics track .9 - swimming pool.10 - unit for individual games (tennis - squash - Table tennis - weight lifting - fitness).",
        "Student Hostel:": "First: Conditional Admissions1- Student must be a student of Bachelor degree of the colleges of Cairo University2- Lives out of Big Cairo zone in the three govern-orates (Cairo, Giza, Qalyoubia)3- The age of the new student in the first of October is 22 years4-  The age of student in the previous years at the first of October is 28 years5- student must be unmarried ( male/female)6-  To prove his health, psychological and nervousness fitness from the public administration of preservative affairs7- student should be succeed and passed to the higher stage without any subjects even from previous years8- had not previously been in penalties except the warning / drawing attention / student activities prevention9- had not previously been in one of the penalties of university cities starting from warning10- students shouldn't have any financial benefits from the previous year11- His resident shouldn't be ended managerial in the past year12- The acceptance priority is according to the geographical distance and the ageRequired papers:1- 4 new personal pictures for the student with his/her name written on them, stamped with the college stamp at the side , while the pictures attached to the application are stamped at front2- photo of the national ID for the Egyptian student and a photo of the passport for the immigrant student3- attached to the file a prove for the student's residence by a new official document ( electricity receipt - water receipt - gas receipt - telephone receipt)4- photo of ID card for the new student ( General secondary - equivalent)5- photo of the success certificate for the student of technical instituteSubmission dates:starts according to the date of showing the results of coordination office, For the old transferred students in the month of July",
        "Rankings according to Webmetrics:": "691",
        "Rankings according to Shanghai University:": "401 : 500",
        "Ranking among Egyptian Universities (4ICU):": "1"
    },
    "Ain Shams University": {
        "City:": "Cairo",
        "Region:": "Abbasiya",
        "Phone Number:": "(202) 26831474 , (202) 26831231 , (202) 26831490 , (202) 26831417",
        "Fax:": "(202)26847824",
        "Official Website:": "http://www.asu.edu.eg/arabic/",
        "Official Facebook Page:": "https://www.facebook.com/AinShams.University.EG/",
        "Main Address:": "El Khalifa el maamoun St., Heliopolis, Cairo.",
        "Year Founded:": "1950",
        "University presidents:": "Prof.Dr. Mohamed Kamel Hussein (1950 : 1954)Prof.Dr. Mustafa clean (1954 : 1956)Prof.Dr. Ahmed Mohammed badawi (1956 : 1961)Prof.Dr. Mohamed Morsi and Ahmed (1961 : 1967)Prof.Dr. Mohamed helmy Mourad (1967 : 1968)Prof.Dr. Ahmed ezzat Abdel-Karim (1968 : 1969)Prof.Dr. Yusuf Salah el-DIN kotb (1969 : 1972)Prof.Dr. Ismail Ismail ghanem (1972 : 1974)Prof.Dr. Mohamed Nagy Mohamed Fouad Shams (1974 : 1977)Prof.Dr. Abdul Aziz Abdul case of Solomon (1977 : 1980)Prof.Dr. Mohamed Kamel Lela(1980 : 1983)Prof.Dr. Mohammed Al Hashemi (1983 : 1989)Prof.Dr. Abdel Salam Abdel ghaffar (1989 : 1992)Prof.Dr. Abdel wahab Mohamed Abd el hafeez (1992 : 1997)Prof.Dr. Hassan Ahmed ghallab (1997 : 2001)Prof.Dr. Mohamed awad tag eldin (2001 : 2002)Prof.Dr. Saleh Hashem Mustafa (2002 : 2005)Prof.Dr.  Ahmed Ali al-abd (2005 : 2007)Prof.Dr. Ahmed Zaki Badr (2007 : 2010)Prof.Dr. Mohamed maged el-Deeb (2010 : 2011)Prof.Dr. Alaa Fayez (January 2012, April 2012)Prof.Dr. Hasan ISA (May 2012 : January 2016)Prof.Dr. Abd El Wahab Mohamed Ezzat  Abd El Wahab (till now)",
        "Central Library:": "The Central Library of the University of ain Shams, originated with the inception of the University in 1950, and the mosque inside the Palace of saffron on campus, and (15.910) book, and (140.942) message.",
        "Conference halls and theaters:": "1 - large conference room of the University next to the College of pharmacy and hospital, ain Shams University specialist hospital, for up to 800 personnel.2 - room guest house, ain Shams University, for up to 250 people.3 - The Conference Hall of the large amount of Dr. butcher in the Faculty of Commerce : for up to 200 people.",
        "Student Hostel:": "First: admission requirements1- The student should be a non-resident of Greater Cairo, knowing that the centers of Tukh, Kafr Shukr, Banha, Shebin Qanater, Qalioubia, Saff, Atfih, Hawamdiyah, Ayyat, Badrashin, Manshaat Al Qanater, Oases, Great2 - The student must have a secondary school from outside of Greater Cairo3 - The student must be a regular in the bachelor's degree with a certificate of success and appreciation and the percentage of the total student scores4- No penalty shall be imposed against him from one of the disciplinary penalties stipulated in the executive regulations of the law of organizing universities and its amendments or the list of university cities5 - Do not have financial dues to university cities6 - Completion of the application for residence electronically and after the announcement of the result of acceptance All documents, declarations and paper signatures are submitted by the city administration7 - The applicant must be unmarried and have not married before providing an administrative certificate8- Passing the medical examination and conducting the required medical testsSecond: Required papers1- A copy of the national ID card (for the student / student), the guardian and the guarantor, provided that the date of issuance of these cards is from a previous year.2. The guarantor may be replaced by the payment of 200 pounds as a replacement for the guarantor to be recovered in the absence of damages3 - Copy of the nomination card for the new student / student with the rejection of the regional college corresponding to the transfer to it, or submit the first nomination cards at the end of the candidacy and the second after the refusal of the coordination office to accept the transfer (there is a sample on the site)4- A declaration from the guarantor approved by his employer5- Number (16) Photo (4x6)",
        "Rankings according to Webmetrics:": "1557",
        "Rankings according to Shanghai University:": "Out of classification",
        "Ranking among Egyptian Universities (4ICU):": "4"
    },
    "Helwan University": {
        "City:": "Cairo",
        "Region:": "Helwan",
        "Phone Number:": "(02) 25569061 , 25569062",
        "Fax:": "(02) 25565820",
        "Official Website:": "http://www.helwan.edu.eg/Arabic/",
        "Official Facebook Page:": "https://www.facebook.com/helwan.universty/",
        "Main Address:": "Helwan University, ain helwan, Cairo.",
        "Year Founded:": "1975",
        "University presidents:": "Prof. Dr. . Abdel razek Abdel fattah Ibrahim (1975 : 1979)Prof. Dr. Mohammed Ishmael Alam Al Din (1979 : 1986)Prof. Dr.  Kemal Mohammed, Ahmed Al Serag (1986 : 1989)Prof. Dr. Mohamed Kamal  Ahmed Al Etr (1989 : 1993)Prof. Dr. Mohammed, Mahmoud Al Gohary 993 : 1997)Prof. Dr. Hassan Mohammed, Husain Hosni (1997 : 2002)Prof. Dr.Amr Ezzat Salama(2002 : 2004)Prof. Dr. 'Abd al-ḥayy obeid (2004 : 2007)Prof. Dr. Abdullah barakat (2007 : 2009)Prof. Dr. Mahmoud eltayeb (2009 : 2011)Prof. Dr. Mohammed Abdel Hamid al-nashar (2011 : 2012)Prof. Dr. Yasser sakr (2012 : till now).",
        "Central Library:": "The central Library which existed in the campus of the University of helwan, it's considered one of the largest libraries of Egyptian universities ; consists of four floors with a total area estimated as 21,000 square meters, note that the area of one floor of 5200 square meters, can accommodate the Central Library for about 1,000 visitors at one time, as it expands to accommodate about a quarter of a million volumes, other than periodicals, media, electronic.",
        "Conference halls and theaters:": "Prof. Dr. Hassan Hosni Hall  :Accommodates approximately 380 individual, and suitable for seminars, conferences and celebrations, distinguished by the presence of interpretation services during conferences, and a number of saloons to receive the top rating as well as places for waiting cars .",
        "playgrounds:": "Playgrounds of helwan University :Consisting of :1 - a football court provided with athletics track and Bleachers for viewers.2 - three basketball.3. three playgrounds for handball.4 - three volleyball court.5. four tennis courts.",
        "Student Hostel:": "Submission requirements:1-  Student must be  regularly enrolled at the faculty of the university2- Students enrolled at the post-graduate are accepted in the case of existing empty places and in accordance with urgent conditions3- Student isn't one of cairo inhabitants and is obtaining secondary school certificate from out of Cairo not to exceed this condition only by decision of Mr. President of the university if there are reasons for that",
        "Rankings according to Webmetrics:": "2224",
        "Rankings according to Shanghai University:": "Out of classification",
        "Ranking among Egyptian Universities (4ICU):": "10"
    },
    "Benha University": {
        "City:": "Qalyubia",
        "Region:": "Banha",
        "Phone Number:": "(013) 323101, 3231012 ,3213514 , 3213515 , 3213517",
        "Fax:": "(013)3227491 , (013)3213511",
        "Official Website:": "http://www.bu.edu.eg/",
        "Official Facebook Page:": "https://www.facebook.com/BenhaUniversity",
        "Main Address:": "El shaheed Farid nada, banha, kaliobeya.",
        "Year Founded:": "2005",
        "University presidents:": "Prof.Dr.Hossam el Din al-attar (2005 : 2009)Prof.Dr.Mohamed safwat zahran (2009 : 2011)Prof.Dr.Ali Shams el DIN (2011 : till now).",
        "Central Library:": "The Central Library of the University of Banha :Besides containing the traditional information sources of books and references and letters of the scientific periodicals, The Library aims also to provide a number of services to beneficiaries such as :1 - explaining ways of dealing with the techniques and technology used in the library.2. assisting beneficiaries in finding scientific sources that they need in the shortest time and with minimal effort.3 - facilitating access to references that University's libraries are unable to acquire them.4. providing two copies printed of the two coupled six electronic copies of theses.5 - Search in the library's holdings using the \"system of the automated future\".",
        "Conference halls and theaters:": "Grand ball room at the University of banha, comprising :- Hall of conferences and celebrations, big and 850.- Hall of reception and food, and 250.And the next host the following activities :1 - scientific conferences at the local level and for the payment of the prescribed fee.2 - conferences of all unions and corporate records of the corresponding public order and gas contrary to the laws of the state after paying the fees for.3 - theatrical performances and art exhibitions .",
        "Student Hostel:": "First: conditions of acceptance:1- The student must be one of the regular students and enrolled in the college in the stage of License or bachelor degree in any college of Banha University except the open education students.2- student shouldn't  be married.3- Succeed and transferred to the higher stage , priority is for the old students who got a higher degree4- For the new students they are subjected to a comparison between them according to their degrees and their date of birth ( The one who got the highest degree in secondary school and the youngest are preferred )5- Student shouldn't be subjected to any  disciplinary punishment in accordance with the conditions from 1:8 of the internal regulation of the cities of the universities6- The age of the student shouldn't be more then 21 years in the beginning of October  ( General secondary, technical, intermediate institutes)7- The age of student in the past transfer years  shouldn't be more than 26 years in the beginning of OctoberSecond: Required papers:1- Photo copy of the student's national number2- Photo copy of Parent's national number3- A new receipt  of electricity , water or telephone4- 2 personal pictures of the student",
        "Rankings according to Webmetrics:": "1765",
        "Rankings according to Shanghai University:": "Out of classification",
        "Ranking among Egyptian Universities (4ICU):": "7"
    },
    "Tanta University": {
        "City:": "Gharbia",
        "Region:": "Tanta",
        "Phone Number:": "(040) 3313619 , 3317962 : general administration for the Office of President of the University(040) 3317236 : Office of the Vice President for education and Student Affairs(040) 3305978 : the Office of the Vice President for graduate studies(040) 3412315 : the General Directorate for education(040) 3412317 : public administration studies.(040) 3313308 : public administration, Public Relations",
        "Fax:": "(040) 3302785 : general administration for the Office of President of the University(040) 3317236 : Office of the Vice President for education and Student Affairs(040) 3305978 : the Office of the Vice President for graduate studies(040) 3313308 : public administration, Public Relations",
        "Official Website:": "http://www.tanta.edu.eg/ar/index.aspx",
        "Official Facebook Page:": "https://www.facebook.com/Tanta-University-portal-1554179168214037/",
        "Main Address:": "The medical field, military street, city of tanta, gharbia.",
        "Year Founded:": "1972",
        "University presidents:": "Prof.Dr. Hashim Mustafa Nassar (1973 : 1978)Prof.Dr. Abdul Hai Ahmed Mash-hour (1978 : 1983)Prof.Dr. Mohamed Kamal el-akkad (1983 : 1985)Prof.Dr. Raafat Mustafa ISSA (1985 : 1991)Prof.Dr. Al Ashry Hussein Darwish (1991 : 1993)Prof.Dr. Shawky el Sayed khater (1993 : 1997)Prof.Dr. Mohammed Mokhtar Al Bidewi (1997 : 1999)Prof.Dr. Fouad Khalifa Heras (2000 : 2006)Prof.Dr. Abdel-fattah Abdel Mongi sadaqa (2006 : 2010)Prof.Dr. Hala Ahmad Fuad Ismail (2010 : 2012)Prof.Dr. Abdel Hakim Abdel khalek Khalil (2012 : till now).",
        "Central Library:": "The Central Library of the University of tanta, located next to the Faculty of the medical field, and is open to visitors from nine in the morning until five in the evening, whether in school or during the summer holiday, and 11379 book divided as follows :- 7477 the book in Arabic.- 3902 written in foreign languages.This is in addition to the 9629 dissertation are divided as follows :- 1679 Master thesis in Arabic.- 4961 Master thesis in English.- 841 Ph. D. thesis in Arabic.2148 Ph. D. in English.",
        "Conference halls and theaters:": "1 - public service center for conferences and parties :The Medical Council, and consists of five halls, the Grand Hall of the ground floor and sleeps up to 700 troops, said the major role of the V-track to 800, in addition to the 3 rooms on the ground floor, sleeps 80 : 100 individual, it features the center scene of the fight many of the conferences, seminars, concerts, receptions and graduation for university students and others, the center has also a unit of Video Conference to deal with global University, the centre for information service for journalists.2 - The Conference Hall of the new building administrative of the University : up to 447 individuals.",
        "playgrounds:": "Unknown",
        "Student Hostel:": "First: Requirements of acceptance:1- Student should be one of the regular students who is enrolled in one of the colleges of the university in the stage of license or bachelor degree or in technical institution of nursing , The council of administration of the university housing may specialize a certain percentage of places for the immigrant students2- Students isn't one of Tanta city or the near centers residents3- Student isn't subjected to any principle punishment from the university or any other university of the previous academic years4- Student isn't subjected to the punishment of the prevention from sitting in the university housing and the council of the city may accept the student in the mentioned cases5- Isn't due for the fees of staying in the university housing6- The student's staying at the university housing shouldn't be ended managerial in the last year except he proposed an acceptable  excuse  the council7- Isn't married8- proves health fit",
        "Rankings according to Webmetrics:": "2252",
        "Rankings according to Shanghai University:": "Out of classification",
        "Ranking among Egyptian Universities (4ICU):": "12"
    },
    "Menoufia University": {
        "City:": "Monufia",
        "Region:": "Shebin El Kom",
        "Phone Number:": "2224216 , 2224155 , 2224347, 2222170 , 2220894 (048)",
        "Fax:": "2226454 (048)",
        "Official Website:": "http://mu.menofia.edu.eg/Home/ar",
        "Official Facebook Page:": "https://www.facebook.com/Menoufia-University-AR-383381225125142/",
        "Main Address:": "Gamal Abdel Nasser St., shebeen el-kom, menofia Governorate.",
        "Year Founded:": "1976",
        "University presidents:": "Prof. Dr. Zaki shabana (1976 : 1980)Prof. Dr. Mohamed Abdel ghany Mahmoud (1980 : 1981)Prof. Dr. Mustafa bahgat Abdel-related (1981 : 1985)Prof. Dr. Othman Ahmed el-kholy (1985 : 1989)Prof. Dr. ElSayed. Hassan hassanein (1989 : 1993)Prof. Dr. Sakr Ahmed sakr (1993 : 1997)Prof. Dr. Mohamed Ibrahim (1997 : 2000)Prof. Dr. Maghawry shehata diab (2000 : 2002)Prof. Dr. Abbas Ali el hefnawy (2002 : 2007)Prof. Dr. Mohamed Abdel-maksoud, ezz Al-Arab (2007 : 2011)Prof. Dr. Ahmed Hamed Mohamed zaghloul (2011 : 2013)Prof. Dr. Sobhy Mohammed Hassan ghoneim (2013 : 2014)Prof. Dr. Moawad Mohamed moawad al khouly (2014 : up to now).",
        "Central Library:": "Menoufia University was Originated  by Presidential Decree No. 1142 of 1976, and consists then of 4 faculties only, (agriculture, education, engineering, and electronic engineering), and then number increased and arrived at the 22 College and prior to detachment of the branch of the University in Sadat city, transforming it into an independent University in 2013.- Arabic books : 26126 book.Foreign books : 6594 book.Theses : 8301 dissertation (5578 master, 2723 PhD thesis).",
        "playgrounds:": "Olympic sports complex at the University of menoufia and consists of :1 - Stadium sports.2 - room covered up to practice basketball, handball, volleyball, Futsal.3 - outdoor playgrounds .4 - modern gymnastics hall.5 - building of Olympic swimming pool , and includes bathroom for snorkeling, and another for the application.",
        "Student Hostel:": "First : Admission requirements :1- Student must has Egyptian nationality2- Student must be enrolled in one of the colleges of the Menoufia university3- student isn't married4- student should be succeed and accepted5- student isn't subjected to any principle punishment in the college or in the housing during his existence6- the age of the student isn't more than 25 years in the first of October7- Student isn't responsible for financial benefit for the university housing8- the age of new students of industry secondary (3 years system) or general doesn't exceed 20 years in the first of October secondary in 20169-  The age of students of 5 years system or the institution doesn't exceed in the first of October in 2016- In all cases the acceptance in the university housing is according to :- Scientific degree and total degrees- The address of the student's familySecond: The required paper1- Receipt of Electricity under the name of the student's father2- Copy of personal ID ( any change of student's address isn't available to be changed except after passing a whole year in the new address )3- Copy of the admission card4- residence card in the university housing5-  Enrollment proof of student6- Acknowledgment of being unmarried7- Acknowledgment  of liable8- Obligation of student and parent9- Medical examination",
        "Rankings according to Webmetrics:": "2556",
        "Rankings according to Shanghai University:": "Out of classification",
        "Ranking among Egyptian Universities (4ICU):": "26"
    },
    "University of Sadat city": {
        "City:": "Monufia",
        "Region:": "Sadat City",
        "Phone Number:": "(048) 2610374 , 2603206 , 2612139Prof.",
        "Fax:": "Unknown",
        "Official Website:": "http://www.usc.edu.eg/",
        "Official Facebook Page:": "https://www.facebook.com/usc.edu.eg",
        "Main Address:": "Street, Abdel moneim Riad, Sadat city, el monofeya.",
        "Year Founded:": "2013",
        "University presidents:": "Prof.Dr. Salah Sayed Ibrahim the sewer (2013 : til now)",
        "Central Library:": "The Central Library of the University of Sadat city, containing 4066 written in Arabic, and 2403 a book in a foreign language, and 7631 dissertation.",
        "Conference halls and theaters:": "Unknown",
        "playgrounds:": "Unknown",
        "Student Hostel:": "Admission requirements:1- Student is Egyptian2- Student is regular and enrolled in the bachelor's degree3- Student is unmarried4- Student is succeed and passed5- Student isn't subjected to the punishment of prevention from the residence for a week separate or connected or any principle punishment from the college6- Hasn't  previous monetary cut for the university housing7- His residence in the university housing hasn't be ended managerially in the past year8- The age of students:new students of general secondary or equivalent : 20 years oldAbove-average qualification students : 22 yearsOld students : 25 years",
        "Rankings according to Webmetrics:": "10023",
        "Rankings according to Shanghai University:": "Out of classification",
        "Ranking among Egyptian Universities (4ICU):": "40"
    },
    "Damanhour University": {
        "City:": "Beheira",
        "Region:": "Damanhour",
        "Phone Number:": "(045) 3368069",
        "Fax:": "(045) 3368069",
        "Official Website:": "http://www.damanhour.edu.eg/pages/default.aspx",
        "Official Facebook Page:": "https://www.facebook.com/DamanhorUniversity",
        "Main Address:": "27 Galal koraytem Square, Behind Damanhour Stadium, , Behera.",
        "Year Founded:": "2010",
        "University presidents:": "Dr.Hatem Salah el-DIN (2011 : 2015)Dr.Ebed Abdelaty Saleh (2015 : until now)",
        "Central Library:": "The Central library has a number of sections which are:1- Technical procedures section that includesIndexes preparation hallHall for classifications and indexingA hall for supply sectionthe Statistics Unit2- Education service and includes:A hall for books and presented referenceA hall of purchased references and booksA hall for presented and purchased sessions3- Services ,development and Science research and includes:Electronic library hallA hall Center of services of libraries and informationA hall for Scientific translation and publication4- A rare collection section and includes:A hall of university museumA Panorama of heritage hallA hall for the manuscript of the universityExchanging and presenting hallA hall of media bulletin5- Printing and publication section and includes:University pressPhotograph hallBookbinding and rehabilitation hallA hall for printing and photocopyingMonitoring warehouse hall6- Financial and administrative department:Room for financial and administration7-  Digital library department",
        "Conference halls and theaters:": "Unknown",
        "playgrounds:": "Unknown",
        "Student Hostel:": "Required papers:1- 12 of personal pictures, size 4*62- Photocopy of the national card of the student with the origin to be observed3- A photocopy of the national card of the parent4- A photocopy of the nomination card of the new students",
        "Rankings according to Webmetrics:": "8696",
        "Rankings according to Shanghai University:": "Out of classification",
        "Ranking among Egyptian Universities (4ICU):": "32"
    },
    "Zagazig University": {
        "City:": "Sharqia",
        "Region:": "Zagazig",
        "Phone Number:": "2363635 , 2362536 (055)",
        "Fax:": "2345452 (055)",
        "Official Website:": "http://www.zu.edu.eg/",
        "Official Facebook Page:": "https://goo.gl/RHM13P",
        "Main Address:": "El Gamaa St, zagazig, sharqiya.",
        "Year Founded:": "1974",
        "University presidents:": "Prof.Dr.Mohamed Tolba owaida (1974 : 1983)Prof.Dr.Mohammed Abdul Latif Ibrahim (1983 : 1991)Prof.Dr.Mohamed ramzi shaer (1991 : 1997)Prof.Dr.Ahmed Fouad Sheikh (1997 : 2000)Prof.Dr.Mohamed Amin Amer (2000 : 2002)Prof.Dr.Abdel Hamid bahgat fayed (2002 : 2004)Prof.Dr.Maher Mohamed Ali damietta (2004 : 2011)Prof.Dr.Mohamed Mahmoud Abdel-al (2011 : 2013)Prof.Dr.Ashraf Mohamed al-shehhi (2014 : 2015)Prof.Dr.Khalid Hassan ' Abd al-baari (April 2016 : until now).",
        "Central Library:": "The Central Library at the University of zagazig, and consists of a number of continents divided as follows :1 - room (1) containing books on education, science pure and applied, philosophy, psychology, science, business.2 - Hall (2) contain books, references, history, geography, Sociology, education.3 - chamber (3) and on books and references and literature and Arabic language.4 - chamber (4) and the books and references of Arts and Computer Science topics, encyclopedias.5 - Hall (5), the books and references in the Science of Education, politics and Economics.6. the Chamber (6) and books and legal references. (And sets of 1 : 6 (43.608) book it can accommodate up to 600 at one time).7 - Hall reference books and foreign and on write references and the foreign, themes and services on Global to better serve the College process the College of the Humanities, and (29.222) book, it can accommodate up to 150 users.8 - Hall of Arabic messages : contain theses approved from the University in addition to some letters from other universities, exchange and gifting, and is recommended (6247) message, it can accommodate up to 50 users.9 - Hall of letters, foreign : containing theses approved from the University in addition to some letters from other universities, exchange and gifting, and (22.757) message, it can accommodate up to 40 bounces.",
        "Conference halls and theaters:": "Unknown",
        "playgrounds:": "Unknown",
        "Student Hostel:": "Required papers:1- a photocopy of personal ID for the student and the parent2- Medical profile approved by the medical administration which proves that student doesn't have any infection diseases3- Number of 5 new images for the student4- Photocopy of electricity receipt , water or telephone",
        "Rankings according to Webmetrics:": "1899",
        "Rankings according to Shanghai University:": "Out of classification"
    },
    "Alexandria University": {
        "City:": "Alexandria",
        "Region:": "El Shatby",
        "Phone Number:": "(03) 5921675 , 5921676 , 5921677 , 5921678",
        "Fax:": "(03) 5921675 , 5921676 , 5921677 , 5921678",
        "Official Website:": "http://www.alexu.edu.eg/index.php/ar/",
        "Official Facebook Page:": "https://www.facebook.com/AU.AlexU.Edu.Eg.Ar/?fref=nf",
        "Main Address:": "22 Al Gaish Rd, El-Shatby, Alexandria",
        "Year Founded:": "1942",
        "University presidents:": "Prof.Dr.Taha Hussein (1942 : 1944)Prof.Dr .Mansour fahmy (1944 : 1946)Prof.Dr. Muhammad Sadiq Gohar (1946 : 1950)Prof.Dr. Mostafa Amer (1950 : 1953)Prof.Dr. Mohamed awad Mohamed (1953 : 1954)Prof.Dr. El Sayed Mustafa (1954 : 1958)Prof.Dr. Mahmoud Samy (1958 : 1958)Prof.Dr. Abdul Aziz El Sayed (1958 : 1961)Prof.Dr. Ali Mohamed Shaib (1961 : 1963)Prof.Dr. Mohamed Naguib hashad (1963 : 1964)Prof.Dr. Hassan Baghdadi (1964 : 1971)Prof.Dr. Mohamed Lotfy Dowidar (1971 : 1976)Prof.Dr. Ali Reda Al Henedy (1976 : 1980)Prof.Dr. Mahmoud, Al Hadary (1980 : 1984)Prof.Dr. Farid Mustafa (1984 : 1987)Prof.Dr. Abdul Aziz Abu khader (1987 : 1988)Prof.Dr. Sayed Abdul-fattah (1988 : 1992)Prof.Dr. Essam Salem (1992 : 1999)Prof.Dr. Nasr Al din Demir (1999 : 2003)Prof.Dr .Muhammad Abdullah (2003 : 2006)Prof.Dr. Hassan Nder (2006 : 2009)Prof.Dr. Hind Hanafy (2009 : 2011)Prof.Dr. Osama Ibrahim (2011 : 2014)Prof.Dr. Roshdy zahran (2015 : up to now).Prof.Dr. Essam Ahmed Mahmoud",
        "Central Library:": "The Central Library of the University of Alexandria :It's Building is considered the largest office buildings in the central Egyptian universities, where it consists of six floors with a total area of 500 square metres per floor, consists of :1 - Hall of Medical Sciences :And 376 periodically, and 12906 Master thesis, 3352 Ph. D., 62 book scientifically.2 - room engineering :And a 94 patrol, and 2452 a master, and 597 of a PhD, and 50 book scientifically.3 - Chamber of Agriculture :And 104 periodically, and 2715 of a master, and 1249 PhD thesis.4 - halls of Science and graduate studies : and 118 periodically, and 1481 master, and 709 doctoral thesis.5 - the halls of the state operations theory : and 232 periodically.6 - halls of the messaging system : and a 3801 a master, and 2176 PhD thesis.7 - the halls of books and references : and 36194 book.8 - Hall of books : and 1435 book.9 - Hall microfilm : and 14537 movie Mini 1960 periodical in the English language dating back to the period between 1950 and 1983.10 - the hall of manuscripts : and 1312 manuscript.11 - Hall of the museum.",
        "Conference halls and theaters:": "Unknown",
        "playgrounds:": "Unknown",
        "Student Hostel:": "Requirements of acceptance:1- Student is a regular student in the first stage of the university and passed to the higher academic year2- Isn't on of Alexandria residence3- Isn't subjected to any kind of punishments from the university or the college which is provided by the article 126 of the executive regulation of the  Universities Organization Act in the item no. 5 and forward or from University Housing all the time of his study4- Isn't owed a previous residence fees5- New students are accepted (First and second stages) according to the available places and according to the total degrees of general secondary6-  students are accepted (Social cases, Medical cases and blinds ) depending on application lists from management of the University housing in the range of 5%7- Students are accepted in the university housing in accordance with standards of acceptance which are determined by the management of university housing in the beginning of every year and which is organized by the management  of the university and then the rate of acceptance of the admission classes  is determined8- Medical examination  of the old and new students is signed in the medical unit of the university9- Students has no rights of staying after 10 days of the date of announcing results",
        "Rankings according to Webmetrics:": "1248",
        "Rankings according to Shanghai University:": "Out of classification",
        "Ranking among Egyptian Universities (4ICU):": "5"
    },
    "Kafr El Sheikh University": {
        "City:": "Kafr El-Sheikh",
        "Region:": "Kafr El-Sheikh",
        "Phone Number:": "(047) 3214998",
        "Fax:": "(047) 3214998",
        "Official Website:": "http://www.kfs.edu.eg/",
        "Official Facebook Page:": "https://www.facebook.com/www.kfs.edu.eg",
        "Main Address:": "El Gaish Street, Downtown, kafr El-Sheikh.",
        "Year Founded:": "2006",
        "University presidents:": "Dr. Fawzi Ali Turki (2006 : 2011)Dr.Majid lunar (2011 : until now).",
        "Central Library:": "The Central Library of the University of kafr El-Sheikh :Opens its doors to the beneficiaries of ten in the morning until five in the evening, besides containing the traditional information sources of books and references and letters of the scientific periodicals library is also working on providing several services to the beneficiaries such as :1 -access to electronic journals.2. Search in the electronic databases.3 - translation of research articles in various branches of knowledge.4 - facilitate access to references like the University libraries for their acquisition.5 - training the beneficiaries on how to achieve the maximum benefit from the library services.",
        "Conference halls and theaters:": "Under construction.",
        "playgrounds:": "Features of the University of kafr El-Sheikh : it consists of :1 - tennis court ground.2 - playgrounds outdoor.3. the jogging track.4 - info soccer beach.5 - room covered.6. the gym is equipped with fitness machines.7 - circuit boxing.8 - hall for Table tennis.",
        "Student Hostel:": "Admission requirements:1- Student is enrolled and regular in one of the faculties in the departments of license and bachelors degree , not from the affiliated students2- Student isn't living at  Kafr El Shaikh or a near village3- The student has not been sentenced to disciplinary punishment from Kafr El-Sheikh University or from other universities in the previous academic year.4. The student or student who has already resided in the university cities shall not be subject to the penalty of deprivation of residence in the previous year. The city council may accept the student in the city in both cases if he sees a face for that.5 - not be entitled to amounts for university cities in the previous year or any other financial dues.6 - to prove his fitness7. Should he not be married or employed by the government or the public sector, and if the student or student conceals this situation and then becomes clear immediately and shall be subject to legal and disciplinary sanctions8 - The student is considered a waiver of his right to reside in the city, he did not pay the required fees within fifteen days from the date of the announcement of the result of acceptance in the city, and Mr. Professor / Chairman of the City Council on the proposal of the Director General of cities to replace the next student instead of the available Conditions of residence in the city.9. The student's stay in the city shall end with the completion of the college exams. He may continue to reside during the summer vacation if the conditions of his studies require that. He must submit a certificate from the college proving that there is a regular summer study.10. Admission to university cities shall be limited to one academic year and the number of admissions shall be determined at the first of each academic year, except for the students of the final teams of the colleges, which shall continue until June.",
        "Rankings according to Webmetrics:": "2124",
        "Rankings according to Shanghai University:": "Out of classification",
        "Ranking among Egyptian Universities (4ICU):": "18"
    },
    "Damietta University": {
        "City:": "Damietta",
        "Region:": "New Damietta",
        "Phone Number:": "2412376 , 2412378 (057)",
        "Fax:": "2412378 (057)",
        "Official Website:": "http://www.du.edu.eg/",
        "Official Facebook Page:": "https://www.facebook.com/UniversityOfDamietta",
        "Main Address:": "District IV, new damietta, damietta",
        "Year Founded:": "2012",
        "University presidents:": "Prof.Dr. Mamdouh Abdel moneim tinder (March 2013 : September 2013)Prof.Dr. Ramadan Abdel hameed Mohamed el tantawy (2014 : up to now).",
        "Central Library:": "The Central Library of Damietta University is located in the Faculty of Education building. It consists of 5 halls: 1 - Arabic and foreign books hall.2 - Hall of theses.3 - Periodicals Hall.4- Auditorium.5 - Hall of books donated.",
        "Conference halls and theaters:": "Unknown",
        "playgrounds:": "Unknown",
        "Student Hostel:": "Required papers:1- 8 personal pictures of the student size 4 * 62 - Copy of the national ID card for the student and the parent to see3. A social security certificate approved by the Social Affairs Office of the student residence4- Guaranteeing the fulfillment of all financial dues for the university city in the event that the student does not pay the fees approved by the body of the guarantor and stamped with the logo of the Republic (Annex 2)5- Statement of the student's academic status approved by the college (in case of old students)",
        "Rankings according to Webmetrics:": "3744",
        "Rankings according to Shanghai University:": "Out of classification",
        "Ranking among Egyptian Universities (4ICU):": "31"
    },
    "Mansoura University": {
        "City:": "Dakahlia",
        "Region:": "Mansoura",
        "Phone Number:": "(050) 2397054 , 2397055 , 2383781",
        "Fax:": "(050) 2397900 , 239733",
        "Official Website:": "http://www.mans.edu.eg/",
        "Official Facebook Page:": "https://www.facebook.com/MansouraUniversityOfficial/",
        "Main Address:": "El-gomhoria street, mansoura, dakahlia Governorate.",
        "Year Founded:": "1972",
        "University presidents:": "Prof.Dr. Abdel Moneim El Saeed El Badrawy (1973 : 1978)Prof.Dr. Shafiq Ibrahim Balbaa (1978 : 1980)Prof.Dr. Yahya Ahmad Massoud (1980 : 1983)Prof.Dr. Kamal El-Din Kamal Ahmed (1983 : 1987)Prof.Dr. Abdel fattah Mohamed Hassan (1987 : 1990)Prof.Dr. Mohamed Hassanein Emara (1990 : 1994)Prof.Dr. Ahmed Amin Hamza (1994 : 2001)Prof.Dr. Yahya Hussein obeid (2001 : 2003)A.D.Ahmed Gamal el-deen Moussa (2003 : 2004)A.D. Magdy Mohamed Abou Rayan (2004 : 2007)Prof.Dr. Ahmed Bayoumi Shehab Eldin (2007 : 2011)Prof.Dr. El Sayed Ahmed Abdel-khalek (2011 : 2014)Prof.Dr. Mohammed Al knawy (2014 : up to now).",
        "Central Library:": "Central Library of Mansoura University:Located on the campus next to the student services complex, and open to the beneficiaries Sunday to Thursday from 8.30 am to 2.30 pm, and there is a section of books and a section of scientific messages and a section of periodicals, and consists of halls to view, and halls for the library and electronic halls of theses and doctoral, As well as an important part of the Central Library of Mansoura University. It is an auditorium for the blind, which provides its services in Braille and audio media.",
        "Conference halls and theaters:": "Unknown",
        "playgrounds:": "1 - The Olympic Village at Mansoura University consists of:1 - squash complex: consists of two squash halls, and its stands can accommodate 500 spectators.2 - The covered hall: equipped with the latest possibilities, and the school to teach hand cream, and other Taekwondo education, and also hosts many of the volleyball, handball, taekwondo and judo competitions.3 - Pool complex: an area of ​​6000 square meters, and includes an Olympic swimming pool, a training room and a children's pool.4 - Tennis Complex: contains 3 sandy courts, and there are schools to teach tennis.5 - Mansoura University Stadium: It is located on an area of ​​about four acres planted with natural Nigella.6 - Multipurpose stadiums:Consists of 6 stadiums, each stadium is equipped to host the activities of basketball, handball, volleyball, football fountains, and the stadiums of each stadium for 250 spectators.-------------2 - fitness centers and sauna Mansoura University:Located in Al Amal City for Students, Al Zahra City for Female Students and Cihan City for Female Students.",
        "Student Hostel:": "First: Conditions of admission1- The applicant must be a non-resident of Mansoura and its environs (Mansoura, Talkha) or the capitals of Belqas police station, Sherbin, Sinbillawin, Dekernes, Aga, Mahalla al-Kubra and Samannoud.2. The applicant must be a regular Egyptian student enrolled in university faculties in the bachelor's or bachelor's departments. A decision of the board of directors may establish rules and conditions for admission of international students and postgraduate students.3 - prove the fitness of the applicant health4. The applicant shall not be married5. The applicant should not have been sentenced in the previous year directly to one of the disciplinary sanctions mentioned in Article 126 of the Executive Regulations of Law No. 49 of 1972 concerning the organization of universities except for the penalty of the alarm. If the applicant has previously been residing in the university city or university university cities Provided that he has not received the penalty of warning of deprivation of residence or temporary deprivation of liberty in the year immediately preceding or was punished with the final deprivation of residence.6. The applicant must not have completed his residence in the university city for not paying fees.7- The applicant should not be entitled to previous residence fees or debts to the university city.Second: Required papers1 - Data of the case of the student approved by the College2 - Guarantee payment of residence fees or debts approved by the body where the guarantor works3 - a statement of the student's home country accredited by the college bound4 - 8 personal pictures of the student size 4 × 65- A certified certificate from the college for the results of the exam for the previous academic year and its assessment and the sanctions signed in the previous year directly.6. A written declaration from the guardian stating that the student is not married",
        "Rankings according to Webmetrics:": "1113",
        "Rankings according to Shanghai University:": "Out of classification",
        "Ranking among Egyptian Universities (4ICU):": "3"
    },
    "Suez Canal University": {
        "City:": "Ismailia",
        "Region:": "Ismailia",
        "Phone Number:": "3223007 ,3200125 ,3200395  ,3230686 ,3398676 ,3381558 (064)",
        "Fax:": "3205208 ,3381557 (064)",
        "Official Website:": "http://scuegypt.edu.eg/ar/",
        "Official Facebook Page:": "https://www.facebook.com/scuegypt",
        "Main Address:": "Kilo 4.5, ring road, ismailia.",
        "Year Founded:": "1976",
        "University presidents:": "Prof.Dr. Abdul Megeed Osman Mohamed (1967 : 1985)Prof.Dr.  Ahmed Ismail Abdul Majid khedira (1985 : 1993)Prof.Dr. Ahmed Dowidar Abdo Basyouni (1993 : 1997)Prof.Dr. Ahmad shukri Abdul Aziz (1997 : 2000)Prof.Dr. Abdul Hamid Shafik shalaby (2000 : 2001)Prof.Dr. Saeed Khamees El Shamy (2001 : 2002)Prof.Dr. Farouk Mahmoud Abdul kader (2002 : 2007)Prof.Dr. Mohamed Sayed Ahmed El Zoghby (2007 : 2011)Prof.Dr. Mohamed Ahmed Mohammaden  (2011 : 2014)Prof.Dr. Mamdouh Mustafa Ghorab (2014 : up to now).",
        "Central Library:": "The Central Library at Suez Canal University contains about 30 thousand books, 9500 scientific messages in various disciplines, in addition to 34 periodicals, and is frequented by about 300 students per week",
        "Conference halls and theaters:": "Unknown",
        "playgrounds:": "Unknown",
        "Student Hostel:": "First: Conditions of admission1 - be non-residents of Suez or neighboring cities and villages.2 - The student must be restricted to \"regularity\" in one of the faculties of the university in the bachelor's and bachelor's degrees, and may by a decision of the Council of University Cities to establish rules and conditions for the admission of foreign students and postgraduate students.3 - not to judge students with disciplinary sanctions.4 - to prove his fitness.5. The student should not be married.6 - Students are selected according to the ratios and rules determined by the General Directorate of the university citiesSecond: Required papers1. Copy of the card \"national number\" of the student, father or guardian2 - The last receipt of invoice (electricity - telephone - natural gas) provided that it is in the name of the father of the student or the guardian to benefit the place of residence3 - The number of (8) personal image of a modern student size 4 × 64 - Copy of the nomination card for the college as well as pictures of the success statement and a copy of the birth certificate of the student for the new students.5. Copy of the payment guarantee page (page 4) of the application form",
        "Rankings according to Webmetrics:": "2566",
        "Rankings according to Shanghai University:": "Out of classification"
    },
    "Suez University": {
        "City:": "Suez",
        "Region:": "Suez",
        "Phone Number:": "3669913, 3707068 (062)",
        "Official Website:": "http://suezuniv.edu.eg",
        "Official Facebook Page:": "https://www.facebook.com/suezuniv",
        "Main Address:": "City of peace 1, The way of Suez, Suez.",
        "Year Founded:": "2012",
        "University presidents:": "Dr.Maher Mesbah (January 2013 : till now).",
        "Central Library:": "Unknown",
        "Conference halls and theaters:": "Unknown",
        "playgrounds:": "Unknown",
        "Student Hostel:": "Required paper:1- Copy of the student's national ID card (original).2 - Social security certificate approved by the Social Affairs Office of which the residence of the student.3 - Declaration of the guarantor of the student accredited by the body where the guarantor works.4 - The number of (8) personal pictures of the student (size 4 × 6",
        "Rankings according to Webmetrics:": "10407",
        "Rankings according to Shanghai University:": "Out of classification",
        "Ranking among Egyptian Universities (4ICU):": "39"
    },
    "Port Said University": {
        "City:": "Port Said",
        "Region:": "Port Fuad",
        "Phone Number:": "3402344 , 3424075 , 3424074 , 3400341 (066)",
        "Fax:": "3400344 (066)",
        "Official Website:": "http://psu.edu.eg/",
        "Official Facebook Page:": "https://goo.gl/cdQgbA",
        "Main Address:": "Galaa street, city of burvod, Port Said.",
        "Year Founded:": "2010",
        "University presidents:": "Prof.Dr. Shams El Din Mohamed Shaheen : President of the University",
        "Student Hostel:": "Required paper:1 - Copy of the card \"national number\" of the student and father or guardian.2- The last receipt for invoice (electricity, telephone, natural gas) provided that it is in the name of the father of the student or the guardian to benefit the place of residence.3 - The number of (8) a recent personal image of the student size 4 * 64 - Copy of the nomination card for the college as well as pictures of the success statement and the birth certificate mechanized for new students.5 - Copy of the payment guarantee page of the application form, or you can print the attached warranty certificate, fill it and seal it with the logo of the republic from the government institution of the guarantor.6- Two plastic document folders.",
        "Rankings according to Webmetrics:": "3847",
        "Rankings according to Shanghai University:": "Out of classification",
        "Ranking among Egyptian Universities (4ICU):": "36"
    },
    "Fayoum University": {
        "City:": "Faiyum",
        "Region:": "Faiyum",
        "Phone Number:": "(084) 2114074 , 2114087 , 2110045",
        "Fax:": "(084) 2114250",
        "Official Website:": "http://www.fayoum.edu.eg/",
        "Official Facebook Page:": "https://www.facebook.com/FayoumU/",
        "Main Address:": "Tawfiq Hakim, el-fayoum.",
        "Year Founded:": "2005",
        "University presidents:": "Prof.Dr.  Galal Mustafa Saeed (2005 : 2008)Prof.Dr.  Ahmed Magdy Ibrahim Al-gohary (2008 : 2011)Prof.Dr. Abdel Hamid Abdel tawab sabry (2011 : 2014).Prof.Dr. Khaled Ismael Hamza (2014 : up to now).",
        "Central Library:": "The central library of Fayoum University, consists of a number of halls distributed as follows on 4 floors (ground floor + 3 floors) consisting of the library:- Ground floor: Conference Hall, VIP Hall.First floor: Embassy of Knowledge Hall.The second floor: the foreign book hall, the individual and collective research rooms.Third Floor: Arabic Book Hall, Individual and Group Research Rooms, Council Hall, and Children's University Hall.",
        "Conference halls and theaters:": "The Great Hall of Celebrations (Dr. Said Suleiman Hall) at Fayoum University, accommodates 1000 people, equipped with the latest sound equipment, lighting and central air conditioning.",
        "playgrounds:": "Unknown",
        "Student Hostel:": "First: Conditions of admission1- He must be a regular student enrolled in university in bachelor's or bachelor's departments.2- He should not be a resident of the city of Fayoum and the nearby areas, taking into account the local administrative divisions of the governorate in relation to the distance of residence from the university colleges.3 - The priority should be in accordance with the rules and ratios determined by the Council of University Cities, taking into account the representation of all faculties of the University according to available places.4- He shall not be sentenced to one of the disciplinary penalties mentioned in Article 126 of the Executive Regulations of Law No. 49 of 1972 concerning the organization of universities.5 - not be a trap.6 - to prove his fitness.7 - not be married students.8- He shall not be entitled to previous fees for university cities or any other entitlements.9. A person who has already been living in university cities should not have been given the warning of deprivation or deprivation of residence in the previous year.10- A person who has previously resided in university cities should not have been granted the penalty of deprivation of residence permanently.Second: Required papers1. The student shall submit the proof of his place of residence in accordance with an official document (electricity receipt, water receipt, phone or gas bill).2 - Copy of the ID card with the submission of the original to see.3 - Copy of the nomination card with the submission of the original to view for new students at the university.4 - Attach with the form the number of 6 pictures in an envelope and the student's name is written on it and the pictures are recent and the picture is stamped with the college stamp on the back and the pictures affixed to the application form stamped on the face by the college.5. Origin of the envelope withdrawal receipt.6 - Completion of scheduled stamps.",
        "Rankings according to Webmetrics:": "2470",
        "Rankings according to Shanghai University:": "Out of classification",
        "Ranking among Egyptian Universities (4ICU):": "21"
    },
    "Beni Suef University": {
        "City:": "Beni Suef",
        "Region:": "Beni Suef",
        "Phone Number:": "(082) 2356845 , 2356846 , 2324879",
        "Fax:": "(082) 2333367",
        "Official Website:": "http://www.bsu.edu.eg/",
        "Official Facebook Page:": "https://www.facebook.com/BSUUniv",
        "Main Address:": "Salah Salem St., Beni suef.",
        "Year Founded:": "2005",
        "University presidents:": "Prof.Dr. Ahmed Mohamed refaat (2005 : 2008)Prof.Dr. Mohamed Mahmoud Yusuf (2008 : 2011)Prof.Dr. Amin El Sayed lotfi (2011 : until now).",
        "Central Library:": "The Central Library of Beni Suef University:It also provides for the beneficiaries of its services from students and researchers the sources of various information from books, references, scientific messages and local and international diplomas. The work is also done on automating the libraries of the various faculties of Beni Suef University in order to build a unified index to facilitate the researchers and to connect them with other libraries of Egyptian universities Through the \"Egyptian Universities Network\".",
        "Conference halls and theaters:": "The main hall of the Beni Suef University consists of three floors. The total capacity of the three floors is 600 seats and there is a theater.",
        "playgrounds:": "Unknown",
        "Student Hostel:": "First: Admission requirements1 - The student must be restricted to \"regularity\" in one of the faculties of the university in the bachelor's or bachelor's degree.2. The student must be single.3 - be non-residents of the city of Sohag or the centers nearby.4 - not to judge the student any disciplinary sanctions or sanctions.5 - Acceptance of students of critical illness cases \"paralyzed paralysis of the movement, the blind students\" and be graduates of secondary schools for the blind.6 - prove the fitness of the student health.7 - not accept the students transferred and the rate of their nomination or transferred from other universities.Second: Required papers1- Copy of the student ID card and the guardian2 - Application for residence3- Approval by the guarantor4 - 4 personal photos",
        "Rankings according to Webmetrics:": "2701",
        "Rankings according to Shanghai University:": "Out of classification",
        "Ranking among Egyptian Universities (4ICU):": "29"
    },
    "Minia University": {
        "City:": "Minya",
        "Region:": "Minya",
        "Phone Number:": "2334646 , 2348003 , 2342609 , 2372261 (086)",
        "Fax:": "(086) 2342601",
        "Official Website:": "http://www.minia.edu.eg/new/",
        "Official Facebook Page:": "https://www.facebook.com/NewsMiniaUniversity",
        "Main Address:": "A public highway, the land of Shelby, passed away.",
        "Year Founded:": "1976",
        "University presidents:": "Prof.Dr. Abdel moneim Hassan Kamel (1976 : 1979)Prof.Dr. Yahya Ali Sahin (1979 : 1984)Prof.Dr. Mahmoud Kamel al-rayes (1984 : 1988)Prof.Dr. Ihab Hassan Ismail (1988 : 1991)Prof.Dr. Jamal Abu El Makarem Rezk  (1991 : 1999)Prof.Dr. Maher Mostafa Kamel (1999 : 2003)Prof.Dr. Abdel-moneim Abdel-Hamid bassiouni (2003 : 2006)Prof.Dr. Maher gaber Mohamed (2006 : 2011)Prof.Dr. Mohammed Ahmed Sherif (2012 : 2014)Prof.Dr. Jamal al-Din Ali Abul magd (2015 : up to now).",
        "Central Library:": "The Central Library of Minia University is located next to the Faculty of Medicine and the Museum of Modern Art at the University of Minia University campus. It consists of 8 floors and includes internet access rooms.",
        "Conference halls and theaters:": "Unknown",
        "playgrounds:": "Unknown",
        "Student Hostel:": "Admission requirements1- The student must be enrolled in one of the faculties of the university in the bachelor's and bachelor's degrees.2 - The student should be single and not transferred from other universities and non - deposit.3. Exclusion of students with special conditions from the approved disabilities \"poliomyelitis, blindness, amputation of one or both legs\".4 - priority of admission and housing for students of all governorates, and then Assiut and Beni Suef as a second priority, and finally Minya.5. The right of the student to stay in residence shall be waived if he does not apply for lodging on the specified dates.6- Admission to university cities shall be restricted to students who have a high school diploma from inside the Arab Republic of Egypt only and admitted to university faculties except for students of special programs (clinical pharmacology, electromechanical",
        "Rankings according to Webmetrics:": "3486",
        "Rankings according to Shanghai University:": "Out of classification"
    },
    "Assiut University": {
        "City:": "Assiut",
        "Region:": "Assiut",
        "Phone Number:": "(088) 2423333",
        "Fax:": "(088) 2354130",
        "Official Website:": "http://www.aun.edu.eg/arabic/",
        "Official Facebook Page:": "https://www.facebook.com/www.aun.edu.eg",
        "Main Address:": "El gamaa St., nayla khatoun, district West, Assiut.",
        "Year Founded:": "1957",
        "University presidents:": "Prof.Dr. Solaiman Hazeen (1957 : 1965)Prof.Dr.  Hussein Ahmed fahim (1965 : 1966)Prof.Dr.  Abdel wahab el burullus (1967 : 1968)Prof.Dr. Mohamed hamdy el nashar (1969 : 1974) and (1975 : 1979)Prof.Dr. Hassan hamdy Ibrahim (1979 : 1980)Prof.Dr. Abdel razek Hassan (1980 : 1991)Prof.Dr. Mohammad Rajai El Tahlawy(1991 : 1996)Prof.Dr.  Mohamed Raafat Mahmoud (1996 : 2004)Prof.Dr. Mohamed Ibrahim Abdel-qader (2004 : 2006)Prof.Dr. Ezzat abdalla Ahmed (2006 : 2008)Prof.Dr. Mostafa Mohamed Kamal (2008 : 2013)Prof.Dr. Mohamed Abdel samie Eid (2013 : 2015)Prof.Dr. Ahmed abdou Geeis (2015 : up to now).",
        "Central Library:": "The Central Library of Assiut University is located next to the university restaurant on campus. It covers an area of about 500 square meters and is open to beneficiaries from 8 am to 8 pm and has 150 seats.",
        "playgrounds:": "The stadiums of the public service center at the Olympic Village in Assiut University consist of:1 - Football field: The stadium can accommodate up to 12 thousand spectators, and besides football matches can host athletics and other competitions.2 - The old covered hall: equipped with a basket for basketball and volleyball, and can host individual games (karate, judo, wrestling, table tennis).3 - The new covered hall: dedicated to the international matches, and hosts the handball, basketball and volleyball matches, consisting of two stadiums, and can accommodate 1500 spectators.4 - squash complex: consists of two squash courts, each stadium contains 48 seats and an internal radio unit.5 - Tennis complex: consists of two tennis courts, both of which are multi-use where tennis courts can host games (handball, basketball, volleyball, five-football).6 - Swimming pool Olympic: consists of a unit of diving levels gradient, swimming unit includes a main bath of 10 lanes with an area of ​​25 * 50 m and is suitable to host swimming competitions, water polo and water ballet, along with a bath for training and warm up area 12.5 * 25 m, It can accommodate 850 people",
        "Rankings according to Webmetrics:": "1640",
        "Rankings according to Shanghai University:": "Out of classification",
        "Ranking among Egyptian Universities (4ICU):": "6"
    },
    "Sohag University": {
        "City:": "Sohag",
        "Region:": "Sohag",
        "Phone Number:": "(093) 4570000",
        "Fax:": "(093) 4605745",
        "Official Website:": "http://www.sohag-univ.edu.eg/",
        "Official Facebook Page:": "https://www.facebook.com/sou.univ/",
        "Main Address:": "Nasser city, a neighborhood East, akhmim, sohag Governorate.",
        "Year Founded:": "2006",
        "University presidents:": "Prof.Dr. Safaa Mahmoud El SayedTill now",
        "Central Library:": "Unknown",
        "Conference halls and theaters:": "1 - The Great Hall of the University, containing 886 chairs, including 102 chairs for the VIP class.2 - The university conference hall with 380 chairs.",
        "Student Hostel:": "Admission requirements1- The new students in the university cities shall be admitted to distribute the places according to the age and the alias of the younger age and the residents at a distance of 25 km from the city of Sohag.2 - Admission of old students and residents of university cities and housing at least rated at least good as well as the admission of students with disabilities on the basis of a certificate approved by the General Department of Medical Affairs and are distributed after the adoption of the form of housing from the college of the student or the previous year.3 - Accept students who have a good general appreciation and higher than outside the university cities.4 - Students who have social cases are accepted according to the available places and the admission is open after the second phase of the new students is settled.",
        "Rankings according to Webmetrics:": "2939",
        "Rankings according to Shanghai University:": "Out of classification",
        "Ranking among Egyptian Universities (4ICU):": "28"
    },
    "South Valley University": {
        "City:": "Qena",
        "Region:": "Qena",
        "Phone Number:": "3211281(096)",
        "Fax:": "3211279 (096)",
        "Official Website:": "http://www.svu.edu.eg/arabic/",
        "Official Facebook Page:": "https://www.facebook.com/svuar?ref=hl",
        "Main Address:": "Through the help of Osman, qena.",
        "Year Founded:": "1995",
        "University presidents:": "Prof.Dr. Mohamed Raafat Mahmoud.Prof.Dr. Arafat Mohamed KamelProf.Dr. Abd El Maten Musa Abdul Latif.Prof.Dr.Abbas Mansour.",
        "Central Library:": "Unknown",
        "Conference halls and theaters:": "Unknown",
        "playgrounds:": "Unknown",
        "Student Hostel:": "Admission requirements1- The applicant must be a non-resident in the center of the university city, which is (25) km for students and (30) kilometers for students.2 - To be single.3. Students must be enrolled in university or bachelor's programs.4. It shall not have been subjected to any disciplinary sanctions within or outside the University CityMay be canceled in the university cities for any reason. The Chairman of the Board may consider the individual case and give his opinion directly.5 - he should not have completed his stay from the university city due to failure to pay the prescribed fees.6- He shall not have any previous financial benefits for the university city.7. The annual settlement shall be considered and the student shall be vacated by the end of each year and he shall return to the city again.",
        "Rankings according to Webmetrics:": "2692",
        "Rankings according to Shanghai University:": "Out of classification",
        "Ranking among Egyptian Universities (4ICU):": "15"
    },
    "Aswan University": {
        "City:": "Aswan",
        "Region:": "Aswan",
        "Phone Number:": "3480446, 3480447(097)",
        "Fax:": "3480449 (097)",
        "Official Website:": "http://www.aswu.edu.eg/",
        "Official Facebook Page:": "https://www.facebook.com/AswuPortal/",
        "Main Address:": "The city of Sohar, Airport Road, Aswan.",
        "Year Founded:": "2012",
        "University presidents:": "Prof.Dr. Mansour Mohammed Kabbash (2012 :2016)Prof.Dr. Ahmed Ghallab Mohamed Ibrahim ( March 2017 till now)",
        "Central Library:": "Under construction.",
        "Conference halls and theaters:": "Under construction.",
        "playgrounds:": "Aswan University Stadiums: Consists of:1 - International football field.2 - An athletics track consisting of 9 lanes.3 - multi-purpose gym.4 - 4 open fields for the practice of five-foot and hockey.",
        "Student Hostel:": "Admission requirements1. The student must be a student of study, not affiliation2 - The student should be single3 - The student should be medically fit and free from infectious diseases and psychological cases",
        "Rankings according to Webmetrics:": "3838",
        "Rankings according to Shanghai University:": "Out of classification",
        "Ranking among Egyptian Universities (4ICU):": "35"
    },
    "Al-Azhar University - Boys Faculties": {
        "City:": "Cairo",
        "Region:": "Nasr City",
        "Phone Number:": "(02) 22628346, 22623279, 22623278, 22621419",
        "Fax:": "(02) 22623284, 22621404",
        "Official Website:": "http://www.azhar.edu.eg/",
        "Official Facebook Page:": "https://www.facebook.com/mediaazhar1",
        "Main Address:": "1 El Mokhayam El Daem Street, Nasr City, Cairo",
        "Year Founded:": "972",
        "University presidents:": "Prof.Dr. Muhammad Muhammad Amer el-Bahi\t (1961:1964)Prof.Dr. Ahmad Hasan el-Baquri (1964:1969)Prof.Dr. Badawi Abdel Latif Awad\t (1969:1974)Prof.Dr. Muhammad Hasan Fayed\t(1974:1979)Prof.Dr. Abd Allah Gad Higazi (1979:1980)Prof.Dr.  Muhammad el-Tayyeb el-Naggar (1980:1983)Prof.Dr. Mohammad Al-Saadi, Farhoud (1983 : 1987)Prof.Dr. Abdel fattah al-Husseini Sheikh (1987 : 1995)Prof.Dr. Ahmed Omar Hashem (1995 : 2003)Prof.Dr. Ahmed Mohammed Ahmed Al-Tayeb (2003 : 2010)Prof.Dr. Abdullah Al-Husseini (2010 : 2011)Prof.Dr. Osama Mohammed Hassan Abd (2011 : 2014)Prof.Dr. Abdul Hai Azab (2014 : until now)",
        "Central Library:": "Unknown",
        "Conference halls and theaters:": "Unknown",
        "playgrounds:": "Unknown",
        "Student Hostel:": "First: Conditions of admission1 - The student must have a secondary Azhar and within the admissions through an officeCoordination of admission to Al-Azhar University.2. The student shall not be a resident of the governorate in which the university city or its suburbs are located.3. The student shall not be subject to any penalty that requires non-housing.4 - The student must be submitted on the deadline for housing in the university city5 - (blind visually - paralyzing polio - paralyzing paralysis - amputation limb amputation - critical illness requiring residence near the university) In previous cases, a medical certificate is required for the condition of the patient approved by the General Administration of Medical Affairs of the university and the medical committees Determined bySecond: Required papers1- Application form for residence in university cities.2 - the number of 4 pictures of a modern student.3 - A copy of the student's national ID card and the parent or guardian (original for information).4- Medical certificate approved by the General Administration of Medical Affairs of the University for students with special cases.5 - Copy of the receipt of the coordination office and the nomination card for the college and the original to view.",
        "Rankings according to Webmetrics:": "2555",
        "Rankings according to Shanghai University:": "Out of classification",
        "Ranking among Egyptian Universities (4ICU):": "22"
    },
    "Al-Azhar University - Girls Faculties": {
        "City:": "Cairo",
        "Region:": "Nasr City",
        "Phone Number:": "(02) 22628346, 22623279, 22623278, 22621419",
        "Fax:": "(02) 22623284, 22621404",
        "Official Website:": "http://www.azhar.edu.eg/",
        "Official Facebook Page:": "https://www.facebook.com/mediaazhar1",
        "Main Address:": "1 El Mokhayam El Daem Street, Nasr City, Cairo.",
        "Year Founded:": "972",
        "University presidents:": "Prof.Dr. Muhammad Muhammad Amer el-Bahi\t (1961:1964)Prof.Dr. Ahmad Hasan el-Baquri (1964:1969)Prof.Dr. Badawi Abdel Latif Awad\t (1969:1974)Prof.Dr. Muhammad Hasan Fayed\t(1974:1979)Prof.Dr. Abd Allah Gad Higazi (1979:1980)Prof.Dr. Muhammad el-Tayyeb el-Naggar (1980:1983)Prof.Dr. Mohammad Al-Saadi, Farhoud (1983 : 1987)Prof.Dr. Abdel fattah al-Husseini Sheikh (1987 : 1995)Prof.Dr. Ahmed Omar Hashem (1995 : 2003)Prof.Dr. Ahmed Mohammed Ahmed Al-Tayeb (2003 : 2010)Prof.Dr. Abdullah Al-Husseini (2010 : 2011)Prof.Dr. Osama Mohammed Hassan Abd (2011 : 2014)Prof.Dr. Abdul Hai Azab (2014 : until now)",
        "Central Library:": "Unknown",
        "Conference halls and theaters:": "Unknown",
        "playgrounds:": "Unknown",
        "Student Hostel:": "First: Conditions of admission1- The student should have the Azhar secondary and within the admissions through an officeCoordination of admission to Al-Azhar University.2. The student shall not be a resident of the governorate in which the university city or its suburbs are located.3. The student shall not be subject to any penalty which requires non-housing.4 - The student must have submitted on time for housing in the university city5 - (blind visually - paralyzing polio - paralyzing paralysis - amputation limb amputation - critical conditions requiring residence near the university) In previous cases, a medical certificate of the patient's condition must be submitted by the General Administration of Medical Affairs of the university and the medical committees Determined bySecond: Required papers1 - Application form for residence in university cities.2 - the number of 4 pictures of a recent personal student.3 - Copy of the national ID card of the student and the parent or guardian (original for information).4- Medical certificate approved by the General Administration of Medical Affairs in the university for students with special cases.5 - Copy of the receipt of the coordination office and the nomination card for the college and the original to view.",
        "Rankings according to Webmetrics:": "2555",
        "Rankings according to Shanghai University:": "Out of Classification",
        "Ranking among Egyptian Universities (4ICU):": "22"
    },
    "Arish University": {
        "City:": "North Sinai",
        "Region:": "Arish",
        "Phone Number:": "89967114 (012) , 280803330 (012) , 73088004 (012)",
        "Official Website:": "",
        "Official Facebook Page:": "https://www.facebook.com/Arish.University.2016/",
        "Year Founded:": "2016"
    },
    "Matrouh University": {
        "City:": "Matruh",
        "Region:": "Marsa Matruh",
        "Phone Number:": "4948489 (046)",
        "Fax:": "4930311 (046)",
        "Official Website:": "http://www.mau.edu.eg",
        "Official Facebook Page:": "https://is.gd/ZohKMh",
        "Rankings according to Webmetrics:": "Out of classification",
        "Rankings according to Shanghai University:": "Out of classification",
        "Ranking among Egyptian Universities (4ICU):": "Out of classification"
    }
}