let QUESTIONS = [
    "افضل قسم في الكلية", 
    "ما الفرق بين كلية حاسبات ومعهد حاسبات ؟",
    "ما الفرق بين الجامعات الحكومية والخاصة ؟",
    "ما هي مجالات العمل التي توفرها الكلية بعد سنين الدراسة ؟",
    "ما هي عدد سنين الدراسة ؟",
    "ما هي المهارات التي قد تفيدنا في سنين الدراسة ؟",
    "اذكر أمثلة لمهندسين مصريين حققوا نجاحات باهرة",
    "ما الفرق بين قسم الحاسبات فى الكلية الهندسة وقسم الحاسبات فى كلية علوم وكلية حاسبات ومعلومات",
    "ما هى المواد التعليمية المهمة بجانب البرمجة؟",
    "كيف اقدم على الكلية؟",
    "هل تقدم هذه الكلية منح للطلاب و ما تفاصيلها؟",
    "ما هى هندسة البرمجيات؟",
    "هل مجال علوم الحاسب مربح؟",
    "هل دراسة البرمجة صعبة",
    "هل تحتاج الكلية إلى أي معرفة سابقة بالبرمجة ؟",
    "هل هناك تمييز فى سوق العمل بين خريجى قسم الحاسبات فى الكلية الهندسة وقسم الحاسبات فى كلية علوم وكلية حاسبات ومعلومات؟",
    "ايه ال بتعلمه في حاسبات ولازم ازود عليه ايه بعد كده؟",
    "ما هي مصاريف كل كلية اذا كانت اهلية او خاصة؟",
    "ليه حاسبات؟",
    "ما هو مجال علوم الحاسب؟",
    "ما هو متوسط مرتبات مهندسى البرمجيات فى مصر؟",
    "ما هو مجال علوم الحاسب؟",
    "ايه الفرق بين هندسة حاسبات وكلية حاسبات ومعلومات ؟",
    "ريكومنديشن لكورسات اونلاين",
    "التنسيق من كم ؟",
    "اقدر اشتغل مبرمد من دون الكليه ؟",
    "ما الفرق بين البرمجة وهندسة البرمجيات؟",
    "ما هو متوسط مرتبات مهندسى البرمجيات فى الخليج وباقى الدول العربية؟",
    "ما هى المواد التعليمية التى تدرس فى كليات الحاسبات والمعلومات؟",
    "ليه ادخل حاسبات ومعلومات طالما مجموعي جايب هندسة واقدر من هندسة ادخل قسم حاسبات عادي", 
    "علمي علوم ممكن يدخلها؟",
    "تقدر تديني roadmap امشي عليها طول الاربع سنين عشان لما اتخرج اشتغل بدون ما اضطر ادخل program like ITI او اقعد شهور اذاكر ال ناقصني بعد ما تخرج؟.",
    "ما هي التخصصات المتاحة في كلية الحاسبات و المعلومات في جامعة القاهرة",
    "هل هناك شركات عديدة تبحث عن خريجى كليات الحاسبات والمعلومات؟",
    "ما هو المحتوى التعليمى لكلية حاسبات ومعلومات",
    "ادخل حاسبات ولا هندسة،",
    "مجموعها من كام؟",
    "تقدر تقولي من خلال منهج الكلية ايه احسن وقت اقدر ادرس فيه المجال .",
    "ايه هي مجالات حاسبات",
    "هل هناك فرص سفر لأوروبا والولايات المتحدة لمهندسى البرمجيات المصريين؟",
    "هل دراسة البرمجة مكلف",
    "ايه الكورسات المتاحة لإعداد طالب ثانوية عامة للدراسة في الكلية",
    "ايه الفرق بين حاسبات و هندسة",
    "اي الفرق بين علوم و رياضه بالنسبه لحاسبات؟",
    "على سبيل المثال (سنة اولى نركز على البوربليم سولفينج وممكن بيزيكس فرونت اند) ممكن في اجازة تانية نذاكر backend عشان هنكون خدنا داتا بيز وداتا ستراكشر او ماشين ليرنينج عشان هنكون خدنا ماث كتير",
    "هل من الممكن لمهندسى البرمجيات المصريين العمل فى الشركات الكبرى مثل جوجل وفيسبوك وأمازون وميكروسوفت؟",
    "ما تنسيق كل كلية؟",
    "هل ينفع طالب علمي علوم يدخلها",
    "ليه اختار حاسبات مش هندسة",
    "ما الماده المعتمد عليها في الثانويه العامه للدخول ف الكليه ؟",
    "هل الكليه كافيه اني بعد ال4 سنين اشتغل ف السوق ولا لازم دراسه جانبيه ؟",
    "ايه التراكات اللي جوا الكلية؟",
    "اذكر أمثلة لشركات مصرية تعمل فى مجال البرمجيات.",
    "هل يوجد اختبارات للكلية ام لا؟ و ان كان يوجد فما هي؟",
    "ما هى طبيعة الدراسة فى الكلية من حيث صعوبة وسهولة المواد",
    "هل ليها نقابة ؟؟ و اسمها ايه ؟؟ عنوانها ؟",
    "ايه اقسام الكلية ؟",
    "ما هى فرص العمل المتاحة لخريجى كليات الحاسبات",
    "ما الموقع الجغرافي لكل كلية؟",
    "هل لازم اكون شاطر في الماث",
    "ايه هي البروبلم سولفينج",
    "السكن الخاص الكليات؟",
    "هل كلية حاسبات مسليه لو انا مليش ف الكومبيوتر اوي",
    "هل يتم استبدال المبرمجين بالذاكء الاصطناعي؟",
    "ايه الشركات الكبيرة في مجال السوفتوير في مصر",
    "تصنيف الكليات؟",
    "هل content الكلية هيأهلني لسوق العمل ؟",
    "مصاريف الكليات",
    "ايه هي ال skills ال محتاجها عشان لما اتخرج ادخل سوق العمل على طول؟",
    "ايه ال بتعلمه في حاسبات ولازم ازود عليه ايه بعد كده؟",
    "افضل قسم في الكلية",
    "المواد؟",
    "ايه الفرق بين مجالات الشغل جوا حاسبات",
    "ما هي اهم ماده في الكليه ؟",
    "ما هي تخصصات كليه الحاسبات",
    "ايه طبيعة شغل الخريج من حاسبات",
    "عدد سنوات الدراسة؟؟",
    "هل كل أقسام الكلية عبارة عن برمجة وأكواد بس",
    "هل هناك اختلاف بين اقسام كليه الحاسبات",
    "هل جميع التخصصات يمكن العمل فيها عمل حر ؟",
    "ما هي انواع الوظائف في مجال البرمجه ؟",
    "اقدر اشتغل وانا بدرس"
  ]
  
  var i = -1
  
  function getNextQuestion(){
    i = Math.floor(Math.random() * QUESTIONS.length);
    return QUESTIONS[i];
  }
  
  function askAnotherQuestion() {
    var ans = $("#answer").val();
    if (ans == "") {
      alert("من فضلك اكتب شيئا, أو اضغط skip.");
      return;
    }
    $.post("/submit", { answer: ans, question_id:i }, function (response) {
    
    });
  
    $("#question p").text(getNextQuestion());
    $("#answer").val("");
  }
  
  function skip() {
    $("#question p").text(getNextQuestion());
    $("#answer").val("");
  }
  
  function CustomAlert() {
    this.alert = function (message, title) {
      document.body.innerHTML =
        document.body.innerHTML +
        '<div id="dialogoverlay"></div><div id="dialogbox" class="slit-in-vertical"><div><div id="dialogboxhead"></div><div id="dialogboxbody"></div><div id="dialogboxfoot"></div></div></div>';
  
      let dialogoverlay = document.getElementById("dialogoverlay");
      let dialogbox = document.getElementById("dialogbox");
      let dialogboxhead = document.getElementById("dialogboxhead");
  
      let winH = window.innerHeight;
      dialogoverlay.style.height = winH + "px";
  
      dialogbox.style.top = "100px";
  
      dialogoverlay.style.display = "block";
      dialogbox.style.display = "block";
  
      document.getElementById("dialogboxhead").style.display = "block";
  
      if (typeof title === "undefined") {
        document.getElementById("dialogboxhead").style.display = "none";
      } else {
        document.getElementById("dialogboxhead").innerHTML =
          '<i class="fa fa-exclamation-circle" aria-hidden="true"></i> ' + title;
      }
      document.getElementById("dialogboxbody").innerHTML = message;
      document.getElementById("dialogboxfoot").innerHTML =
        '<button class="pure-material-button-contained active" onclick="customAlert.ok()">OK</button>';
      dialogbox.style.dir = "rtl";
      dialogbox.style.textAlign = "right";
      dialogboxhead.style.textAlign = "center";
    };
  
    this.ok = function () {
      document.getElementById("dialogbox").style.display = "none";
      document.getElementById("dialogoverlay").style.display = "none";
    };
  }
  
  instructions = "\
  - إذا صادفت نفس السؤال مرتين، اضغط تخطي.\n<br>\
  - أجب عن الأسئلة التالية باللغة العربية.\n<br>\
  - جميع الأسئلة التالية تخص كليات حاسبات ومعلومات بالجامعات المصرية.\n<br>\
  - أكتب جملة علي الأقل.\n<br>\
  - إذا لم تستطع الإجابة علي أي من الأسئلة، تخطي السؤال.\n<br>\
  - يمكنك الاستعانة ببحث سريع علي الانترنت.\n<br>\
  - كن جادًا في الإجابة علي الأسئلة، لا تضع إجابات هزلية.";
  
  console.log(instructions)
  header = "التعليمات"
  
  let customAlert = new CustomAlert();
  
  window.onload = function () {
    customAlert.alert(instructions, header);
    $("#question p").text(getNextQuestion());
  };